package brain

import (
	"testing"
)

func Test_huefy_Express(t *testing.T) {
	intention := new(HuefyIntention)
	data := map[string]string{
		"":                     "",
		"джо":                  "джо",
		"что-то заблокировать": "что-то хуёвать", // todo improve
		"двуличие":             "хуичие",
		"Джокер":               "хуёкер",
		"слышно":               "хуишно",
		"чекнуть":              "хуекнуть",
		"рулетка":              "хуетка",
		"трансформация":        "хуяция",
		"реакция":              "хуеакция",
		"сообщения":            "хуения",
		"сениоры":              "хуиоры",
		"Шутки по времени":     "хуютки по хуени", // todo improve
		"бинарные опционы":     "хуярные хуионы",
		"несет":                "хуесет",
		"что несет":            "что хуесет",
		"надо несет":           "хуядо хуесет",
		"надос несет":          "хуядос хуесет",
		"интересно":            "хуесно",
		"ну бля время теряем":  "ну бля хуемя хуеряем",
		"Потому что надо было не шифры ваши писать":      "хуёму что хуядо хуило не хуифры хуяши хуисать",
		"ну вот реально... скрам ушел в отпуск, команда": "ну вот хуеально... скрам ушел в отпуск, хуянда",
		"А там это, евро дешевле доллара уже какой день": "А там это, евро хуевле хуяра уже хуякой день",
	}
	for k, expected := range data {
		_, result := intention.Express(k)
		if result != expected {
			t.Error("huefyed ", k, ": ", expected, " != ", result)
		}
	}
}
